program(1.0)
[buildInfo = dict<tensor<string, []>, tensor<string, []>>({{"coremlc-component-MIL", "3500.14.1"}, {"coremlc-version", "3500.32.1"}, {"coremltools-component-tensorflow", "2.20.0"}, {"coremltools-version", "9.0"}})]
{
    func main<ios15>(tensor<fp32, [1, 3, 224, 224]> input_1) {
            tensor<fp32, [1, 3, 1, 1]> input_1__biased___y_0 = const()[name = tensor<string, []>("input_1__biased___y_0"), val = tensor<fp32, [1, 3, 1, 1]>([[[[-0x1.eeb852p+6]], [[-0x1.d31db2p+6]], [[-0x1.9fc18ap+6]]]])];
            tensor<fp32, [1, 3, 224, 224]> input_1__biased__ = add(x = input_1, y = input_1__biased___y_0)[name = tensor<string, []>("input_1__biased__")];
            tensor<string, []> pad_0_mode_0 = const()[name = tensor<string, []>("pad_0_mode_0"), val = tensor<string, []>("constant")];
            tensor<int32, [8]> pad_5_pad_0 = const()[name = tensor<string, []>("pad_5_pad_0"), val = tensor<int32, [8]>([0, 0, 0, 0, 0, 1, 0, 1])];
            tensor<string, []> input_1_to_fp16_dtype_0 = const()[name = tensor<string, []>("input_1_to_fp16_dtype_0"), val = tensor<string, []>("fp16")];
            tensor<fp16, []> const_0_to_fp16 = const()[name = tensor<string, []>("const_0_to_fp16"), val = tensor<fp16, []>(0x0p+0)];
            tensor<fp16, [1, 3, 224, 224]> input_1_to_fp16 = cast(dtype = input_1_to_fp16_dtype_0, x = input_1__biased__)[name = tensor<string, []>("cast_6")];
            tensor<fp16, [1, 3, 225, 225]> pad_5_cast_fp16 = pad(constant_val = const_0_to_fp16, mode = pad_0_mode_0, pad = pad_5_pad_0, x = input_1_to_fp16)[name = tensor<string, []>("pad_5_cast_fp16")];
            tensor<string, []> model_2_1_conv1_bn_1_batchnorm_mul_1x_pad_type_0 = const()[name = tensor<string, []>("model_2_1_conv1_bn_1_batchnorm_mul_1x_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> model_2_1_conv1_bn_1_batchnorm_mul_1x_strides_0 = const()[name = tensor<string, []>("model_2_1_conv1_bn_1_batchnorm_mul_1x_strides_0"), val = tensor<int32, [2]>([2, 2])];
            tensor<int32, [2]> model_2_1_conv1_bn_1_batchnorm_mul_1x_dilations_0 = const()[name = tensor<string, []>("model_2_1_conv1_bn_1_batchnorm_mul_1x_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> model_2_1_conv1_bn_1_batchnorm_mul_1x_groups_0 = const()[name = tensor<string, []>("model_2_1_conv1_bn_1_batchnorm_mul_1x_groups_0"), val = tensor<int32, []>(1)];
            tensor<int32, [4]> model_2_1_conv1_bn_1_batchnorm_mul_1x_pad_0 = const()[name = tensor<string, []>("model_2_1_conv1_bn_1_batchnorm_mul_1x_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [32, 3, 3, 3]> transpose_0_to_fp16 = const()[name = tensor<string, []>("transpose_0_to_fp16"), val = tensor<fp16, [32, 3, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(64)))];
            tensor<fp16, [32]> const_44_to_fp16 = const()[name = tensor<string, []>("const_44_to_fp16"), val = tensor<fp16, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1856)))];
            tensor<fp16, [1, 32, 112, 112]> model_2_1_conv1_bn_1_batchnorm_add_1_cast_fp16 = conv(bias = const_44_to_fp16, dilations = model_2_1_conv1_bn_1_batchnorm_mul_1x_dilations_0, groups = model_2_1_conv1_bn_1_batchnorm_mul_1x_groups_0, pad = model_2_1_conv1_bn_1_batchnorm_mul_1x_pad_0, pad_type = model_2_1_conv1_bn_1_batchnorm_mul_1x_pad_type_0, strides = model_2_1_conv1_bn_1_batchnorm_mul_1x_strides_0, weight = transpose_0_to_fp16, x = pad_5_cast_fp16)[name = tensor<string, []>("model_2_1_conv1_bn_1_batchnorm_add_1_cast_fp16")];
            tensor<fp16, [1, 32, 112, 112]> model_2_1_conv1_relu_1_Relu6_cast_fp16 = relu6(x = model_2_1_conv1_bn_1_batchnorm_add_1_cast_fp16)[name = tensor<string, []>("model_2_1_conv1_relu_1_Relu6_cast_fp16")];
            tensor<string, []> model_2_1_conv_dw_1_1_depthwisex_pad_type_0 = const()[name = tensor<string, []>("model_2_1_conv_dw_1_1_depthwisex_pad_type_0"), val = tensor<string, []>("same")];
            tensor<int32, [2]> model_2_1_conv_dw_1_1_depthwisex_strides_0 = const()[name = tensor<string, []>("model_2_1_conv_dw_1_1_depthwisex_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> model_2_1_conv_dw_1_1_depthwisex_dilations_0 = const()[name = tensor<string, []>("model_2_1_conv_dw_1_1_depthwisex_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> model_2_1_conv_dw_1_1_depthwisex_groups_0 = const()[name = tensor<string, []>("model_2_1_conv_dw_1_1_depthwisex_groups_0"), val = tensor<int32, []>(32)];
            tensor<int32, [4]> model_2_1_conv_dw_1_1_depthwisex_pad_0 = const()[name = tensor<string, []>("model_2_1_conv_dw_1_1_depthwisex_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [32, 1, 3, 3]> model_2_1_conv_dw_1_bn_1_batchnorm_mul_1_weight_0_to_fp16 = const()[name = tensor<string, []>("model_2_1_conv_dw_1_bn_1_batchnorm_mul_1_weight_0_to_fp16"), val = tensor<fp16, [32, 1, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1984)))];
            tensor<fp16, [32]> const_45_to_fp16 = const()[name = tensor<string, []>("const_45_to_fp16"), val = tensor<fp16, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2624)))];
            tensor<fp16, [1, 32, 112, 112]> model_2_1_conv_dw_1_bn_1_batchnorm_add_1_cast_fp16 = conv(bias = const_45_to_fp16, dilations = model_2_1_conv_dw_1_1_depthwisex_dilations_0, groups = model_2_1_conv_dw_1_1_depthwisex_groups_0, pad = model_2_1_conv_dw_1_1_depthwisex_pad_0, pad_type = model_2_1_conv_dw_1_1_depthwisex_pad_type_0, strides = model_2_1_conv_dw_1_1_depthwisex_strides_0, weight = model_2_1_conv_dw_1_bn_1_batchnorm_mul_1_weight_0_to_fp16, x = model_2_1_conv1_relu_1_Relu6_cast_fp16)[name = tensor<string, []>("model_2_1_conv_dw_1_bn_1_batchnorm_add_1_cast_fp16")];
            tensor<fp16, [1, 32, 112, 112]> model_2_1_conv_dw_1_relu_1_Relu6_cast_fp16 = relu6(x = model_2_1_conv_dw_1_bn_1_batchnorm_add_1_cast_fp16)[name = tensor<string, []>("model_2_1_conv_dw_1_relu_1_Relu6_cast_fp16")];
            tensor<string, []> model_2_1_conv_pw_1_bn_1_batchnorm_mul_1x_pad_type_0 = const()[name = tensor<string, []>("model_2_1_conv_pw_1_bn_1_batchnorm_mul_1x_pad_type_0"), val = tensor<string, []>("same")];
            tensor<int32, [2]> model_2_1_conv_pw_1_bn_1_batchnorm_mul_1x_strides_0 = const()[name = tensor<string, []>("model_2_1_conv_pw_1_bn_1_batchnorm_mul_1x_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> model_2_1_conv_pw_1_bn_1_batchnorm_mul_1x_dilations_0 = const()[name = tensor<string, []>("model_2_1_conv_pw_1_bn_1_batchnorm_mul_1x_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> model_2_1_conv_pw_1_bn_1_batchnorm_mul_1x_groups_0 = const()[name = tensor<string, []>("model_2_1_conv_pw_1_bn_1_batchnorm_mul_1x_groups_0"), val = tensor<int32, []>(1)];
            tensor<int32, [4]> model_2_1_conv_pw_1_bn_1_batchnorm_mul_1x_pad_0 = const()[name = tensor<string, []>("model_2_1_conv_pw_1_bn_1_batchnorm_mul_1x_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [64, 32, 1, 1]> transpose_4_to_fp16 = const()[name = tensor<string, []>("transpose_4_to_fp16"), val = tensor<fp16, [64, 32, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2752)))];
            tensor<fp16, [64]> const_46_to_fp16 = const()[name = tensor<string, []>("const_46_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(6912)))];
            tensor<fp16, [1, 64, 112, 112]> model_2_1_conv_pw_1_bn_1_batchnorm_add_1_cast_fp16 = conv(bias = const_46_to_fp16, dilations = model_2_1_conv_pw_1_bn_1_batchnorm_mul_1x_dilations_0, groups = model_2_1_conv_pw_1_bn_1_batchnorm_mul_1x_groups_0, pad = model_2_1_conv_pw_1_bn_1_batchnorm_mul_1x_pad_0, pad_type = model_2_1_conv_pw_1_bn_1_batchnorm_mul_1x_pad_type_0, strides = model_2_1_conv_pw_1_bn_1_batchnorm_mul_1x_strides_0, weight = transpose_4_to_fp16, x = model_2_1_conv_dw_1_relu_1_Relu6_cast_fp16)[name = tensor<string, []>("model_2_1_conv_pw_1_bn_1_batchnorm_add_1_cast_fp16")];
            tensor<fp16, [1, 64, 112, 112]> model_2_1_conv_pw_1_relu_1_Relu6_cast_fp16 = relu6(x = model_2_1_conv_pw_1_bn_1_batchnorm_add_1_cast_fp16)[name = tensor<string, []>("model_2_1_conv_pw_1_relu_1_Relu6_cast_fp16")];
            tensor<string, []> pad_1_mode_0 = const()[name = tensor<string, []>("pad_1_mode_0"), val = tensor<string, []>("constant")];
            tensor<int32, [8]> pad_6_pad_0 = const()[name = tensor<string, []>("pad_6_pad_0"), val = tensor<int32, [8]>([0, 0, 0, 0, 0, 1, 0, 1])];
            tensor<fp16, []> const_1_to_fp16 = const()[name = tensor<string, []>("const_1_to_fp16"), val = tensor<fp16, []>(0x0p+0)];
            tensor<fp16, [1, 64, 113, 113]> pad_6_cast_fp16 = pad(constant_val = const_1_to_fp16, mode = pad_1_mode_0, pad = pad_6_pad_0, x = model_2_1_conv_pw_1_relu_1_Relu6_cast_fp16)[name = tensor<string, []>("pad_6_cast_fp16")];
            tensor<string, []> model_2_1_conv_dw_2_1_depthwisex_pad_type_0 = const()[name = tensor<string, []>("model_2_1_conv_dw_2_1_depthwisex_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> model_2_1_conv_dw_2_1_depthwisex_strides_0 = const()[name = tensor<string, []>("model_2_1_conv_dw_2_1_depthwisex_strides_0"), val = tensor<int32, [2]>([2, 2])];
            tensor<int32, [2]> model_2_1_conv_dw_2_1_depthwisex_dilations_0 = const()[name = tensor<string, []>("model_2_1_conv_dw_2_1_depthwisex_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> model_2_1_conv_dw_2_1_depthwisex_groups_0 = const()[name = tensor<string, []>("model_2_1_conv_dw_2_1_depthwisex_groups_0"), val = tensor<int32, []>(64)];
            tensor<int32, [4]> model_2_1_conv_dw_2_1_depthwisex_pad_0 = const()[name = tensor<string, []>("model_2_1_conv_dw_2_1_depthwisex_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [64, 1, 3, 3]> model_2_1_conv_dw_2_bn_1_batchnorm_mul_1_weight_0_to_fp16 = const()[name = tensor<string, []>("model_2_1_conv_dw_2_bn_1_batchnorm_mul_1_weight_0_to_fp16"), val = tensor<fp16, [64, 1, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(7104)))];
            tensor<fp16, [64]> const_47_to_fp16 = const()[name = tensor<string, []>("const_47_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(8320)))];
            tensor<fp16, [1, 64, 56, 56]> model_2_1_conv_dw_2_bn_1_batchnorm_add_1_cast_fp16 = conv(bias = const_47_to_fp16, dilations = model_2_1_conv_dw_2_1_depthwisex_dilations_0, groups = model_2_1_conv_dw_2_1_depthwisex_groups_0, pad = model_2_1_conv_dw_2_1_depthwisex_pad_0, pad_type = model_2_1_conv_dw_2_1_depthwisex_pad_type_0, strides = model_2_1_conv_dw_2_1_depthwisex_strides_0, weight = model_2_1_conv_dw_2_bn_1_batchnorm_mul_1_weight_0_to_fp16, x = pad_6_cast_fp16)[name = tensor<string, []>("model_2_1_conv_dw_2_bn_1_batchnorm_add_1_cast_fp16")];
            tensor<fp16, [1, 64, 56, 56]> model_2_1_conv_dw_2_relu_1_Relu6_cast_fp16 = relu6(x = model_2_1_conv_dw_2_bn_1_batchnorm_add_1_cast_fp16)[name = tensor<string, []>("model_2_1_conv_dw_2_relu_1_Relu6_cast_fp16")];
            tensor<string, []> model_2_1_conv_pw_2_bn_1_batchnorm_mul_1x_pad_type_0 = const()[name = tensor<string, []>("model_2_1_conv_pw_2_bn_1_batchnorm_mul_1x_pad_type_0"), val = tensor<string, []>("same")];
            tensor<int32, [2]> model_2_1_conv_pw_2_bn_1_batchnorm_mul_1x_strides_0 = const()[name = tensor<string, []>("model_2_1_conv_pw_2_bn_1_batchnorm_mul_1x_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> model_2_1_conv_pw_2_bn_1_batchnorm_mul_1x_dilations_0 = const()[name = tensor<string, []>("model_2_1_conv_pw_2_bn_1_batchnorm_mul_1x_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> model_2_1_conv_pw_2_bn_1_batchnorm_mul_1x_groups_0 = const()[name = tensor<string, []>("model_2_1_conv_pw_2_bn_1_batchnorm_mul_1x_groups_0"), val = tensor<int32, []>(1)];
            tensor<int32, [4]> model_2_1_conv_pw_2_bn_1_batchnorm_mul_1x_pad_0 = const()[name = tensor<string, []>("model_2_1_conv_pw_2_bn_1_batchnorm_mul_1x_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [128, 64, 1, 1]> transpose_8_to_fp16 = const()[name = tensor<string, []>("transpose_8_to_fp16"), val = tensor<fp16, [128, 64, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(8512)))];
            tensor<fp16, [128]> const_48_to_fp16 = const()[name = tensor<string, []>("const_48_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(24960)))];
            tensor<fp16, [1, 128, 56, 56]> model_2_1_conv_pw_2_bn_1_batchnorm_add_1_cast_fp16 = conv(bias = const_48_to_fp16, dilations = model_2_1_conv_pw_2_bn_1_batchnorm_mul_1x_dilations_0, groups = model_2_1_conv_pw_2_bn_1_batchnorm_mul_1x_groups_0, pad = model_2_1_conv_pw_2_bn_1_batchnorm_mul_1x_pad_0, pad_type = model_2_1_conv_pw_2_bn_1_batchnorm_mul_1x_pad_type_0, strides = model_2_1_conv_pw_2_bn_1_batchnorm_mul_1x_strides_0, weight = transpose_8_to_fp16, x = model_2_1_conv_dw_2_relu_1_Relu6_cast_fp16)[name = tensor<string, []>("model_2_1_conv_pw_2_bn_1_batchnorm_add_1_cast_fp16")];
            tensor<fp16, [1, 128, 56, 56]> model_2_1_conv_pw_2_relu_1_Relu6_cast_fp16 = relu6(x = model_2_1_conv_pw_2_bn_1_batchnorm_add_1_cast_fp16)[name = tensor<string, []>("model_2_1_conv_pw_2_relu_1_Relu6_cast_fp16")];
            tensor<string, []> model_2_1_conv_dw_3_1_depthwisex_pad_type_0 = const()[name = tensor<string, []>("model_2_1_conv_dw_3_1_depthwisex_pad_type_0"), val = tensor<string, []>("same")];
            tensor<int32, [2]> model_2_1_conv_dw_3_1_depthwisex_strides_0 = const()[name = tensor<string, []>("model_2_1_conv_dw_3_1_depthwisex_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> model_2_1_conv_dw_3_1_depthwisex_dilations_0 = const()[name = tensor<string, []>("model_2_1_conv_dw_3_1_depthwisex_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> model_2_1_conv_dw_3_1_depthwisex_groups_0 = const()[name = tensor<string, []>("model_2_1_conv_dw_3_1_depthwisex_groups_0"), val = tensor<int32, []>(128)];
            tensor<int32, [4]> model_2_1_conv_dw_3_1_depthwisex_pad_0 = const()[name = tensor<string, []>("model_2_1_conv_dw_3_1_depthwisex_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [128, 1, 3, 3]> model_2_1_conv_dw_3_bn_1_batchnorm_mul_1_weight_0_to_fp16 = const()[name = tensor<string, []>("model_2_1_conv_dw_3_bn_1_batchnorm_mul_1_weight_0_to_fp16"), val = tensor<fp16, [128, 1, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(25280)))];
            tensor<fp16, [128]> const_49_to_fp16 = const()[name = tensor<string, []>("const_49_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(27648)))];
            tensor<fp16, [1, 128, 56, 56]> model_2_1_conv_dw_3_bn_1_batchnorm_add_1_cast_fp16 = conv(bias = const_49_to_fp16, dilations = model_2_1_conv_dw_3_1_depthwisex_dilations_0, groups = model_2_1_conv_dw_3_1_depthwisex_groups_0, pad = model_2_1_conv_dw_3_1_depthwisex_pad_0, pad_type = model_2_1_conv_dw_3_1_depthwisex_pad_type_0, strides = model_2_1_conv_dw_3_1_depthwisex_strides_0, weight = model_2_1_conv_dw_3_bn_1_batchnorm_mul_1_weight_0_to_fp16, x = model_2_1_conv_pw_2_relu_1_Relu6_cast_fp16)[name = tensor<string, []>("model_2_1_conv_dw_3_bn_1_batchnorm_add_1_cast_fp16")];
            tensor<fp16, [1, 128, 56, 56]> model_2_1_conv_dw_3_relu_1_Relu6_cast_fp16 = relu6(x = model_2_1_conv_dw_3_bn_1_batchnorm_add_1_cast_fp16)[name = tensor<string, []>("model_2_1_conv_dw_3_relu_1_Relu6_cast_fp16")];
            tensor<string, []> model_2_1_conv_pw_3_bn_1_batchnorm_mul_1x_pad_type_0 = const()[name = tensor<string, []>("model_2_1_conv_pw_3_bn_1_batchnorm_mul_1x_pad_type_0"), val = tensor<string, []>("same")];
            tensor<int32, [2]> model_2_1_conv_pw_3_bn_1_batchnorm_mul_1x_strides_0 = const()[name = tensor<string, []>("model_2_1_conv_pw_3_bn_1_batchnorm_mul_1x_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> model_2_1_conv_pw_3_bn_1_batchnorm_mul_1x_dilations_0 = const()[name = tensor<string, []>("model_2_1_conv_pw_3_bn_1_batchnorm_mul_1x_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> model_2_1_conv_pw_3_bn_1_batchnorm_mul_1x_groups_0 = const()[name = tensor<string, []>("model_2_1_conv_pw_3_bn_1_batchnorm_mul_1x_groups_0"), val = tensor<int32, []>(1)];
            tensor<int32, [4]> model_2_1_conv_pw_3_bn_1_batchnorm_mul_1x_pad_0 = const()[name = tensor<string, []>("model_2_1_conv_pw_3_bn_1_batchnorm_mul_1x_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [128, 128, 1, 1]> transpose_12_to_fp16 = const()[name = tensor<string, []>("transpose_12_to_fp16"), val = tensor<fp16, [128, 128, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(27968)))];
            tensor<fp16, [128]> const_50_to_fp16 = const()[name = tensor<string, []>("const_50_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(60800)))];
            tensor<fp16, [1, 128, 56, 56]> model_2_1_conv_pw_3_bn_1_batchnorm_add_1_cast_fp16 = conv(bias = const_50_to_fp16, dilations = model_2_1_conv_pw_3_bn_1_batchnorm_mul_1x_dilations_0, groups = model_2_1_conv_pw_3_bn_1_batchnorm_mul_1x_groups_0, pad = model_2_1_conv_pw_3_bn_1_batchnorm_mul_1x_pad_0, pad_type = model_2_1_conv_pw_3_bn_1_batchnorm_mul_1x_pad_type_0, strides = model_2_1_conv_pw_3_bn_1_batchnorm_mul_1x_strides_0, weight = transpose_12_to_fp16, x = model_2_1_conv_dw_3_relu_1_Relu6_cast_fp16)[name = tensor<string, []>("model_2_1_conv_pw_3_bn_1_batchnorm_add_1_cast_fp16")];
            tensor<fp16, [1, 128, 56, 56]> model_2_1_conv_pw_3_relu_1_Relu6_cast_fp16 = relu6(x = model_2_1_conv_pw_3_bn_1_batchnorm_add_1_cast_fp16)[name = tensor<string, []>("model_2_1_conv_pw_3_relu_1_Relu6_cast_fp16")];
            tensor<string, []> pad_2_mode_0 = const()[name = tensor<string, []>("pad_2_mode_0"), val = tensor<string, []>("constant")];
            tensor<int32, [8]> pad_7_pad_0 = const()[name = tensor<string, []>("pad_7_pad_0"), val = tensor<int32, [8]>([0, 0, 0, 0, 0, 1, 0, 1])];
            tensor<fp16, []> const_2_to_fp16 = const()[name = tensor<string, []>("const_2_to_fp16"), val = tensor<fp16, []>(0x0p+0)];
            tensor<fp16, [1, 128, 57, 57]> pad_7_cast_fp16 = pad(constant_val = const_2_to_fp16, mode = pad_2_mode_0, pad = pad_7_pad_0, x = model_2_1_conv_pw_3_relu_1_Relu6_cast_fp16)[name = tensor<string, []>("pad_7_cast_fp16")];
            tensor<string, []> model_2_1_conv_dw_4_1_depthwisex_pad_type_0 = const()[name = tensor<string, []>("model_2_1_conv_dw_4_1_depthwisex_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> model_2_1_conv_dw_4_1_depthwisex_strides_0 = const()[name = tensor<string, []>("model_2_1_conv_dw_4_1_depthwisex_strides_0"), val = tensor<int32, [2]>([2, 2])];
            tensor<int32, [2]> model_2_1_conv_dw_4_1_depthwisex_dilations_0 = const()[name = tensor<string, []>("model_2_1_conv_dw_4_1_depthwisex_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> model_2_1_conv_dw_4_1_depthwisex_groups_0 = const()[name = tensor<string, []>("model_2_1_conv_dw_4_1_depthwisex_groups_0"), val = tensor<int32, []>(128)];
            tensor<int32, [4]> model_2_1_conv_dw_4_1_depthwisex_pad_0 = const()[name = tensor<string, []>("model_2_1_conv_dw_4_1_depthwisex_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [128, 1, 3, 3]> model_2_1_conv_dw_4_bn_1_batchnorm_mul_1_weight_0_to_fp16 = const()[name = tensor<string, []>("model_2_1_conv_dw_4_bn_1_batchnorm_mul_1_weight_0_to_fp16"), val = tensor<fp16, [128, 1, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(61120)))];
            tensor<fp16, [128]> const_51_to_fp16 = const()[name = tensor<string, []>("const_51_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(63488)))];
            tensor<fp16, [1, 128, 28, 28]> model_2_1_conv_dw_4_bn_1_batchnorm_add_1_cast_fp16 = conv(bias = const_51_to_fp16, dilations = model_2_1_conv_dw_4_1_depthwisex_dilations_0, groups = model_2_1_conv_dw_4_1_depthwisex_groups_0, pad = model_2_1_conv_dw_4_1_depthwisex_pad_0, pad_type = model_2_1_conv_dw_4_1_depthwisex_pad_type_0, strides = model_2_1_conv_dw_4_1_depthwisex_strides_0, weight = model_2_1_conv_dw_4_bn_1_batchnorm_mul_1_weight_0_to_fp16, x = pad_7_cast_fp16)[name = tensor<string, []>("model_2_1_conv_dw_4_bn_1_batchnorm_add_1_cast_fp16")];
            tensor<fp16, [1, 128, 28, 28]> model_2_1_conv_dw_4_relu_1_Relu6_cast_fp16 = relu6(x = model_2_1_conv_dw_4_bn_1_batchnorm_add_1_cast_fp16)[name = tensor<string, []>("model_2_1_conv_dw_4_relu_1_Relu6_cast_fp16")];
            tensor<string, []> model_2_1_conv_pw_4_bn_1_batchnorm_mul_1x_pad_type_0 = const()[name = tensor<string, []>("model_2_1_conv_pw_4_bn_1_batchnorm_mul_1x_pad_type_0"), val = tensor<string, []>("same")];
            tensor<int32, [2]> model_2_1_conv_pw_4_bn_1_batchnorm_mul_1x_strides_0 = const()[name = tensor<string, []>("model_2_1_conv_pw_4_bn_1_batchnorm_mul_1x_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> model_2_1_conv_pw_4_bn_1_batchnorm_mul_1x_dilations_0 = const()[name = tensor<string, []>("model_2_1_conv_pw_4_bn_1_batchnorm_mul_1x_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> model_2_1_conv_pw_4_bn_1_batchnorm_mul_1x_groups_0 = const()[name = tensor<string, []>("model_2_1_conv_pw_4_bn_1_batchnorm_mul_1x_groups_0"), val = tensor<int32, []>(1)];
            tensor<int32, [4]> model_2_1_conv_pw_4_bn_1_batchnorm_mul_1x_pad_0 = const()[name = tensor<string, []>("model_2_1_conv_pw_4_bn_1_batchnorm_mul_1x_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [256, 128, 1, 1]> transpose_16_to_fp16 = const()[name = tensor<string, []>("transpose_16_to_fp16"), val = tensor<fp16, [256, 128, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(63808)))];
            tensor<fp16, [256]> const_52_to_fp16 = const()[name = tensor<string, []>("const_52_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(129408)))];
            tensor<fp16, [1, 256, 28, 28]> model_2_1_conv_pw_4_bn_1_batchnorm_add_1_cast_fp16 = conv(bias = const_52_to_fp16, dilations = model_2_1_conv_pw_4_bn_1_batchnorm_mul_1x_dilations_0, groups = model_2_1_conv_pw_4_bn_1_batchnorm_mul_1x_groups_0, pad = model_2_1_conv_pw_4_bn_1_batchnorm_mul_1x_pad_0, pad_type = model_2_1_conv_pw_4_bn_1_batchnorm_mul_1x_pad_type_0, strides = model_2_1_conv_pw_4_bn_1_batchnorm_mul_1x_strides_0, weight = transpose_16_to_fp16, x = model_2_1_conv_dw_4_relu_1_Relu6_cast_fp16)[name = tensor<string, []>("model_2_1_conv_pw_4_bn_1_batchnorm_add_1_cast_fp16")];
            tensor<fp16, [1, 256, 28, 28]> model_2_1_conv_pw_4_relu_1_Relu6_cast_fp16 = relu6(x = model_2_1_conv_pw_4_bn_1_batchnorm_add_1_cast_fp16)[name = tensor<string, []>("model_2_1_conv_pw_4_relu_1_Relu6_cast_fp16")];
            tensor<string, []> model_2_1_conv_dw_5_1_depthwisex_pad_type_0 = const()[name = tensor<string, []>("model_2_1_conv_dw_5_1_depthwisex_pad_type_0"), val = tensor<string, []>("same")];
            tensor<int32, [2]> model_2_1_conv_dw_5_1_depthwisex_strides_0 = const()[name = tensor<string, []>("model_2_1_conv_dw_5_1_depthwisex_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> model_2_1_conv_dw_5_1_depthwisex_dilations_0 = const()[name = tensor<string, []>("model_2_1_conv_dw_5_1_depthwisex_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> model_2_1_conv_dw_5_1_depthwisex_groups_0 = const()[name = tensor<string, []>("model_2_1_conv_dw_5_1_depthwisex_groups_0"), val = tensor<int32, []>(256)];
            tensor<int32, [4]> model_2_1_conv_dw_5_1_depthwisex_pad_0 = const()[name = tensor<string, []>("model_2_1_conv_dw_5_1_depthwisex_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [256, 1, 3, 3]> model_2_1_conv_dw_5_bn_1_batchnorm_mul_1_weight_0_to_fp16 = const()[name = tensor<string, []>("model_2_1_conv_dw_5_bn_1_batchnorm_mul_1_weight_0_to_fp16"), val = tensor<fp16, [256, 1, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(129984)))];
            tensor<fp16, [256]> const_53_to_fp16 = const()[name = tensor<string, []>("const_53_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(134656)))];
            tensor<fp16, [1, 256, 28, 28]> model_2_1_conv_dw_5_bn_1_batchnorm_add_1_cast_fp16 = conv(bias = const_53_to_fp16, dilations = model_2_1_conv_dw_5_1_depthwisex_dilations_0, groups = model_2_1_conv_dw_5_1_depthwisex_groups_0, pad = model_2_1_conv_dw_5_1_depthwisex_pad_0, pad_type = model_2_1_conv_dw_5_1_depthwisex_pad_type_0, strides = model_2_1_conv_dw_5_1_depthwisex_strides_0, weight = model_2_1_conv_dw_5_bn_1_batchnorm_mul_1_weight_0_to_fp16, x = model_2_1_conv_pw_4_relu_1_Relu6_cast_fp16)[name = tensor<string, []>("model_2_1_conv_dw_5_bn_1_batchnorm_add_1_cast_fp16")];
            tensor<fp16, [1, 256, 28, 28]> model_2_1_conv_dw_5_relu_1_Relu6_cast_fp16 = relu6(x = model_2_1_conv_dw_5_bn_1_batchnorm_add_1_cast_fp16)[name = tensor<string, []>("model_2_1_conv_dw_5_relu_1_Relu6_cast_fp16")];
            tensor<string, []> model_2_1_conv_pw_5_bn_1_batchnorm_mul_1x_pad_type_0 = const()[name = tensor<string, []>("model_2_1_conv_pw_5_bn_1_batchnorm_mul_1x_pad_type_0"), val = tensor<string, []>("same")];
            tensor<int32, [2]> model_2_1_conv_pw_5_bn_1_batchnorm_mul_1x_strides_0 = const()[name = tensor<string, []>("model_2_1_conv_pw_5_bn_1_batchnorm_mul_1x_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> model_2_1_conv_pw_5_bn_1_batchnorm_mul_1x_dilations_0 = const()[name = tensor<string, []>("model_2_1_conv_pw_5_bn_1_batchnorm_mul_1x_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> model_2_1_conv_pw_5_bn_1_batchnorm_mul_1x_groups_0 = const()[name = tensor<string, []>("model_2_1_conv_pw_5_bn_1_batchnorm_mul_1x_groups_0"), val = tensor<int32, []>(1)];
            tensor<int32, [4]> model_2_1_conv_pw_5_bn_1_batchnorm_mul_1x_pad_0 = const()[name = tensor<string, []>("model_2_1_conv_pw_5_bn_1_batchnorm_mul_1x_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [256, 256, 1, 1]> transpose_20_to_fp16 = const()[name = tensor<string, []>("transpose_20_to_fp16"), val = tensor<fp16, [256, 256, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(135232)))];
            tensor<fp16, [256]> const_54_to_fp16 = const()[name = tensor<string, []>("const_54_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(266368)))];
            tensor<fp16, [1, 256, 28, 28]> model_2_1_conv_pw_5_bn_1_batchnorm_add_1_cast_fp16 = conv(bias = const_54_to_fp16, dilations = model_2_1_conv_pw_5_bn_1_batchnorm_mul_1x_dilations_0, groups = model_2_1_conv_pw_5_bn_1_batchnorm_mul_1x_groups_0, pad = model_2_1_conv_pw_5_bn_1_batchnorm_mul_1x_pad_0, pad_type = model_2_1_conv_pw_5_bn_1_batchnorm_mul_1x_pad_type_0, strides = model_2_1_conv_pw_5_bn_1_batchnorm_mul_1x_strides_0, weight = transpose_20_to_fp16, x = model_2_1_conv_dw_5_relu_1_Relu6_cast_fp16)[name = tensor<string, []>("model_2_1_conv_pw_5_bn_1_batchnorm_add_1_cast_fp16")];
            tensor<fp16, [1, 256, 28, 28]> model_2_1_conv_pw_5_relu_1_Relu6_cast_fp16 = relu6(x = model_2_1_conv_pw_5_bn_1_batchnorm_add_1_cast_fp16)[name = tensor<string, []>("model_2_1_conv_pw_5_relu_1_Relu6_cast_fp16")];
            tensor<string, []> pad_3_mode_0 = const()[name = tensor<string, []>("pad_3_mode_0"), val = tensor<string, []>("constant")];
            tensor<int32, [8]> pad_8_pad_0 = const()[name = tensor<string, []>("pad_8_pad_0"), val = tensor<int32, [8]>([0, 0, 0, 0, 0, 1, 0, 1])];
            tensor<fp16, []> const_3_to_fp16 = const()[name = tensor<string, []>("const_3_to_fp16"), val = tensor<fp16, []>(0x0p+0)];
            tensor<fp16, [1, 256, 29, 29]> pad_8_cast_fp16 = pad(constant_val = const_3_to_fp16, mode = pad_3_mode_0, pad = pad_8_pad_0, x = model_2_1_conv_pw_5_relu_1_Relu6_cast_fp16)[name = tensor<string, []>("pad_8_cast_fp16")];
            tensor<string, []> model_2_1_conv_dw_6_1_depthwisex_pad_type_0 = const()[name = tensor<string, []>("model_2_1_conv_dw_6_1_depthwisex_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> model_2_1_conv_dw_6_1_depthwisex_strides_0 = const()[name = tensor<string, []>("model_2_1_conv_dw_6_1_depthwisex_strides_0"), val = tensor<int32, [2]>([2, 2])];
            tensor<int32, [2]> model_2_1_conv_dw_6_1_depthwisex_dilations_0 = const()[name = tensor<string, []>("model_2_1_conv_dw_6_1_depthwisex_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> model_2_1_conv_dw_6_1_depthwisex_groups_0 = const()[name = tensor<string, []>("model_2_1_conv_dw_6_1_depthwisex_groups_0"), val = tensor<int32, []>(256)];
            tensor<int32, [4]> model_2_1_conv_dw_6_1_depthwisex_pad_0 = const()[name = tensor<string, []>("model_2_1_conv_dw_6_1_depthwisex_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [256, 1, 3, 3]> model_2_1_conv_dw_6_bn_1_batchnorm_mul_1_weight_0_to_fp16 = const()[name = tensor<string, []>("model_2_1_conv_dw_6_bn_1_batchnorm_mul_1_weight_0_to_fp16"), val = tensor<fp16, [256, 1, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(266944)))];
            tensor<fp16, [256]> const_55_to_fp16 = const()[name = tensor<string, []>("const_55_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(271616)))];
            tensor<fp16, [1, 256, 14, 14]> model_2_1_conv_dw_6_bn_1_batchnorm_add_1_cast_fp16 = conv(bias = const_55_to_fp16, dilations = model_2_1_conv_dw_6_1_depthwisex_dilations_0, groups = model_2_1_conv_dw_6_1_depthwisex_groups_0, pad = model_2_1_conv_dw_6_1_depthwisex_pad_0, pad_type = model_2_1_conv_dw_6_1_depthwisex_pad_type_0, strides = model_2_1_conv_dw_6_1_depthwisex_strides_0, weight = model_2_1_conv_dw_6_bn_1_batchnorm_mul_1_weight_0_to_fp16, x = pad_8_cast_fp16)[name = tensor<string, []>("model_2_1_conv_dw_6_bn_1_batchnorm_add_1_cast_fp16")];
            tensor<fp16, [1, 256, 14, 14]> model_2_1_conv_dw_6_relu_1_Relu6_cast_fp16 = relu6(x = model_2_1_conv_dw_6_bn_1_batchnorm_add_1_cast_fp16)[name = tensor<string, []>("model_2_1_conv_dw_6_relu_1_Relu6_cast_fp16")];
            tensor<string, []> model_2_1_conv_pw_6_bn_1_batchnorm_mul_1x_pad_type_0 = const()[name = tensor<string, []>("model_2_1_conv_pw_6_bn_1_batchnorm_mul_1x_pad_type_0"), val = tensor<string, []>("same")];
            tensor<int32, [2]> model_2_1_conv_pw_6_bn_1_batchnorm_mul_1x_strides_0 = const()[name = tensor<string, []>("model_2_1_conv_pw_6_bn_1_batchnorm_mul_1x_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> model_2_1_conv_pw_6_bn_1_batchnorm_mul_1x_dilations_0 = const()[name = tensor<string, []>("model_2_1_conv_pw_6_bn_1_batchnorm_mul_1x_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> model_2_1_conv_pw_6_bn_1_batchnorm_mul_1x_groups_0 = const()[name = tensor<string, []>("model_2_1_conv_pw_6_bn_1_batchnorm_mul_1x_groups_0"), val = tensor<int32, []>(1)];
            tensor<int32, [4]> model_2_1_conv_pw_6_bn_1_batchnorm_mul_1x_pad_0 = const()[name = tensor<string, []>("model_2_1_conv_pw_6_bn_1_batchnorm_mul_1x_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [512, 256, 1, 1]> transpose_24_to_fp16 = const()[name = tensor<string, []>("transpose_24_to_fp16"), val = tensor<fp16, [512, 256, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(272192)))];
            tensor<fp16, [512]> const_56_to_fp16 = const()[name = tensor<string, []>("const_56_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(534400)))];
            tensor<fp16, [1, 512, 14, 14]> model_2_1_conv_pw_6_bn_1_batchnorm_add_1_cast_fp16 = conv(bias = const_56_to_fp16, dilations = model_2_1_conv_pw_6_bn_1_batchnorm_mul_1x_dilations_0, groups = model_2_1_conv_pw_6_bn_1_batchnorm_mul_1x_groups_0, pad = model_2_1_conv_pw_6_bn_1_batchnorm_mul_1x_pad_0, pad_type = model_2_1_conv_pw_6_bn_1_batchnorm_mul_1x_pad_type_0, strides = model_2_1_conv_pw_6_bn_1_batchnorm_mul_1x_strides_0, weight = transpose_24_to_fp16, x = model_2_1_conv_dw_6_relu_1_Relu6_cast_fp16)[name = tensor<string, []>("model_2_1_conv_pw_6_bn_1_batchnorm_add_1_cast_fp16")];
            tensor<fp16, [1, 512, 14, 14]> model_2_1_conv_pw_6_relu_1_Relu6_cast_fp16 = relu6(x = model_2_1_conv_pw_6_bn_1_batchnorm_add_1_cast_fp16)[name = tensor<string, []>("model_2_1_conv_pw_6_relu_1_Relu6_cast_fp16")];
            tensor<string, []> model_2_1_conv_dw_7_1_depthwisex_pad_type_0 = const()[name = tensor<string, []>("model_2_1_conv_dw_7_1_depthwisex_pad_type_0"), val = tensor<string, []>("same")];
            tensor<int32, [2]> model_2_1_conv_dw_7_1_depthwisex_strides_0 = const()[name = tensor<string, []>("model_2_1_conv_dw_7_1_depthwisex_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> model_2_1_conv_dw_7_1_depthwisex_dilations_0 = const()[name = tensor<string, []>("model_2_1_conv_dw_7_1_depthwisex_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> model_2_1_conv_dw_7_1_depthwisex_groups_0 = const()[name = tensor<string, []>("model_2_1_conv_dw_7_1_depthwisex_groups_0"), val = tensor<int32, []>(512)];
            tensor<int32, [4]> model_2_1_conv_dw_7_1_depthwisex_pad_0 = const()[name = tensor<string, []>("model_2_1_conv_dw_7_1_depthwisex_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [512, 1, 3, 3]> model_2_1_conv_dw_7_bn_1_batchnorm_mul_1_weight_0_to_fp16 = const()[name = tensor<string, []>("model_2_1_conv_dw_7_bn_1_batchnorm_mul_1_weight_0_to_fp16"), val = tensor<fp16, [512, 1, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(535488)))];
            tensor<fp16, [512]> const_57_to_fp16 = const()[name = tensor<string, []>("const_57_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(544768)))];
            tensor<fp16, [1, 512, 14, 14]> model_2_1_conv_dw_7_bn_1_batchnorm_add_1_cast_fp16 = conv(bias = const_57_to_fp16, dilations = model_2_1_conv_dw_7_1_depthwisex_dilations_0, groups = model_2_1_conv_dw_7_1_depthwisex_groups_0, pad = model_2_1_conv_dw_7_1_depthwisex_pad_0, pad_type = model_2_1_conv_dw_7_1_depthwisex_pad_type_0, strides = model_2_1_conv_dw_7_1_depthwisex_strides_0, weight = model_2_1_conv_dw_7_bn_1_batchnorm_mul_1_weight_0_to_fp16, x = model_2_1_conv_pw_6_relu_1_Relu6_cast_fp16)[name = tensor<string, []>("model_2_1_conv_dw_7_bn_1_batchnorm_add_1_cast_fp16")];
            tensor<fp16, [1, 512, 14, 14]> model_2_1_conv_dw_7_relu_1_Relu6_cast_fp16 = relu6(x = model_2_1_conv_dw_7_bn_1_batchnorm_add_1_cast_fp16)[name = tensor<string, []>("model_2_1_conv_dw_7_relu_1_Relu6_cast_fp16")];
            tensor<string, []> model_2_1_conv_pw_7_bn_1_batchnorm_mul_1x_pad_type_0 = const()[name = tensor<string, []>("model_2_1_conv_pw_7_bn_1_batchnorm_mul_1x_pad_type_0"), val = tensor<string, []>("same")];
            tensor<int32, [2]> model_2_1_conv_pw_7_bn_1_batchnorm_mul_1x_strides_0 = const()[name = tensor<string, []>("model_2_1_conv_pw_7_bn_1_batchnorm_mul_1x_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> model_2_1_conv_pw_7_bn_1_batchnorm_mul_1x_dilations_0 = const()[name = tensor<string, []>("model_2_1_conv_pw_7_bn_1_batchnorm_mul_1x_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> model_2_1_conv_pw_7_bn_1_batchnorm_mul_1x_groups_0 = const()[name = tensor<string, []>("model_2_1_conv_pw_7_bn_1_batchnorm_mul_1x_groups_0"), val = tensor<int32, []>(1)];
            tensor<int32, [4]> model_2_1_conv_pw_7_bn_1_batchnorm_mul_1x_pad_0 = const()[name = tensor<string, []>("model_2_1_conv_pw_7_bn_1_batchnorm_mul_1x_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [512, 512, 1, 1]> transpose_28_to_fp16 = const()[name = tensor<string, []>("transpose_28_to_fp16"), val = tensor<fp16, [512, 512, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(545856)))];
            tensor<fp16, [512]> const_58_to_fp16 = const()[name = tensor<string, []>("const_58_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1070208)))];
            tensor<fp16, [1, 512, 14, 14]> model_2_1_conv_pw_7_bn_1_batchnorm_add_1_cast_fp16 = conv(bias = const_58_to_fp16, dilations = model_2_1_conv_pw_7_bn_1_batchnorm_mul_1x_dilations_0, groups = model_2_1_conv_pw_7_bn_1_batchnorm_mul_1x_groups_0, pad = model_2_1_conv_pw_7_bn_1_batchnorm_mul_1x_pad_0, pad_type = model_2_1_conv_pw_7_bn_1_batchnorm_mul_1x_pad_type_0, strides = model_2_1_conv_pw_7_bn_1_batchnorm_mul_1x_strides_0, weight = transpose_28_to_fp16, x = model_2_1_conv_dw_7_relu_1_Relu6_cast_fp16)[name = tensor<string, []>("model_2_1_conv_pw_7_bn_1_batchnorm_add_1_cast_fp16")];
            tensor<fp16, [1, 512, 14, 14]> model_2_1_conv_pw_7_relu_1_Relu6_cast_fp16 = relu6(x = model_2_1_conv_pw_7_bn_1_batchnorm_add_1_cast_fp16)[name = tensor<string, []>("model_2_1_conv_pw_7_relu_1_Relu6_cast_fp16")];
            tensor<string, []> model_2_1_conv_dw_8_1_depthwisex_pad_type_0 = const()[name = tensor<string, []>("model_2_1_conv_dw_8_1_depthwisex_pad_type_0"), val = tensor<string, []>("same")];
            tensor<int32, [2]> model_2_1_conv_dw_8_1_depthwisex_strides_0 = const()[name = tensor<string, []>("model_2_1_conv_dw_8_1_depthwisex_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> model_2_1_conv_dw_8_1_depthwisex_dilations_0 = const()[name = tensor<string, []>("model_2_1_conv_dw_8_1_depthwisex_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> model_2_1_conv_dw_8_1_depthwisex_groups_0 = const()[name = tensor<string, []>("model_2_1_conv_dw_8_1_depthwisex_groups_0"), val = tensor<int32, []>(512)];
            tensor<int32, [4]> model_2_1_conv_dw_8_1_depthwisex_pad_0 = const()[name = tensor<string, []>("model_2_1_conv_dw_8_1_depthwisex_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [512, 1, 3, 3]> model_2_1_conv_dw_8_bn_1_batchnorm_mul_1_weight_0_to_fp16 = const()[name = tensor<string, []>("model_2_1_conv_dw_8_bn_1_batchnorm_mul_1_weight_0_to_fp16"), val = tensor<fp16, [512, 1, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1071296)))];
            tensor<fp16, [512]> const_59_to_fp16 = const()[name = tensor<string, []>("const_59_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1080576)))];
            tensor<fp16, [1, 512, 14, 14]> model_2_1_conv_dw_8_bn_1_batchnorm_add_1_cast_fp16 = conv(bias = const_59_to_fp16, dilations = model_2_1_conv_dw_8_1_depthwisex_dilations_0, groups = model_2_1_conv_dw_8_1_depthwisex_groups_0, pad = model_2_1_conv_dw_8_1_depthwisex_pad_0, pad_type = model_2_1_conv_dw_8_1_depthwisex_pad_type_0, strides = model_2_1_conv_dw_8_1_depthwisex_strides_0, weight = model_2_1_conv_dw_8_bn_1_batchnorm_mul_1_weight_0_to_fp16, x = model_2_1_conv_pw_7_relu_1_Relu6_cast_fp16)[name = tensor<string, []>("model_2_1_conv_dw_8_bn_1_batchnorm_add_1_cast_fp16")];
            tensor<fp16, [1, 512, 14, 14]> model_2_1_conv_dw_8_relu_1_Relu6_cast_fp16 = relu6(x = model_2_1_conv_dw_8_bn_1_batchnorm_add_1_cast_fp16)[name = tensor<string, []>("model_2_1_conv_dw_8_relu_1_Relu6_cast_fp16")];
            tensor<string, []> model_2_1_conv_pw_8_bn_1_batchnorm_mul_1x_pad_type_0 = const()[name = tensor<string, []>("model_2_1_conv_pw_8_bn_1_batchnorm_mul_1x_pad_type_0"), val = tensor<string, []>("same")];
            tensor<int32, [2]> model_2_1_conv_pw_8_bn_1_batchnorm_mul_1x_strides_0 = const()[name = tensor<string, []>("model_2_1_conv_pw_8_bn_1_batchnorm_mul_1x_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> model_2_1_conv_pw_8_bn_1_batchnorm_mul_1x_dilations_0 = const()[name = tensor<string, []>("model_2_1_conv_pw_8_bn_1_batchnorm_mul_1x_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> model_2_1_conv_pw_8_bn_1_batchnorm_mul_1x_groups_0 = const()[name = tensor<string, []>("model_2_1_conv_pw_8_bn_1_batchnorm_mul_1x_groups_0"), val = tensor<int32, []>(1)];
            tensor<int32, [4]> model_2_1_conv_pw_8_bn_1_batchnorm_mul_1x_pad_0 = const()[name = tensor<string, []>("model_2_1_conv_pw_8_bn_1_batchnorm_mul_1x_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [512, 512, 1, 1]> transpose_32_to_fp16 = const()[name = tensor<string, []>("transpose_32_to_fp16"), val = tensor<fp16, [512, 512, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1081664)))];
            tensor<fp16, [512]> const_60_to_fp16 = const()[name = tensor<string, []>("const_60_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1606016)))];
            tensor<fp16, [1, 512, 14, 14]> model_2_1_conv_pw_8_bn_1_batchnorm_add_1_cast_fp16 = conv(bias = const_60_to_fp16, dilations = model_2_1_conv_pw_8_bn_1_batchnorm_mul_1x_dilations_0, groups = model_2_1_conv_pw_8_bn_1_batchnorm_mul_1x_groups_0, pad = model_2_1_conv_pw_8_bn_1_batchnorm_mul_1x_pad_0, pad_type = model_2_1_conv_pw_8_bn_1_batchnorm_mul_1x_pad_type_0, strides = model_2_1_conv_pw_8_bn_1_batchnorm_mul_1x_strides_0, weight = transpose_32_to_fp16, x = model_2_1_conv_dw_8_relu_1_Relu6_cast_fp16)[name = tensor<string, []>("model_2_1_conv_pw_8_bn_1_batchnorm_add_1_cast_fp16")];
            tensor<fp16, [1, 512, 14, 14]> model_2_1_conv_pw_8_relu_1_Relu6_cast_fp16 = relu6(x = model_2_1_conv_pw_8_bn_1_batchnorm_add_1_cast_fp16)[name = tensor<string, []>("model_2_1_conv_pw_8_relu_1_Relu6_cast_fp16")];
            tensor<string, []> model_2_1_conv_dw_9_1_depthwisex_pad_type_0 = const()[name = tensor<string, []>("model_2_1_conv_dw_9_1_depthwisex_pad_type_0"), val = tensor<string, []>("same")];
            tensor<int32, [2]> model_2_1_conv_dw_9_1_depthwisex_strides_0 = const()[name = tensor<string, []>("model_2_1_conv_dw_9_1_depthwisex_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> model_2_1_conv_dw_9_1_depthwisex_dilations_0 = const()[name = tensor<string, []>("model_2_1_conv_dw_9_1_depthwisex_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> model_2_1_conv_dw_9_1_depthwisex_groups_0 = const()[name = tensor<string, []>("model_2_1_conv_dw_9_1_depthwisex_groups_0"), val = tensor<int32, []>(512)];
            tensor<int32, [4]> model_2_1_conv_dw_9_1_depthwisex_pad_0 = const()[name = tensor<string, []>("model_2_1_conv_dw_9_1_depthwisex_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [512, 1, 3, 3]> model_2_1_conv_dw_9_bn_1_batchnorm_mul_1_weight_0_to_fp16 = const()[name = tensor<string, []>("model_2_1_conv_dw_9_bn_1_batchnorm_mul_1_weight_0_to_fp16"), val = tensor<fp16, [512, 1, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1607104)))];
            tensor<fp16, [512]> const_61_to_fp16 = const()[name = tensor<string, []>("const_61_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1616384)))];
            tensor<fp16, [1, 512, 14, 14]> model_2_1_conv_dw_9_bn_1_batchnorm_add_1_cast_fp16 = conv(bias = const_61_to_fp16, dilations = model_2_1_conv_dw_9_1_depthwisex_dilations_0, groups = model_2_1_conv_dw_9_1_depthwisex_groups_0, pad = model_2_1_conv_dw_9_1_depthwisex_pad_0, pad_type = model_2_1_conv_dw_9_1_depthwisex_pad_type_0, strides = model_2_1_conv_dw_9_1_depthwisex_strides_0, weight = model_2_1_conv_dw_9_bn_1_batchnorm_mul_1_weight_0_to_fp16, x = model_2_1_conv_pw_8_relu_1_Relu6_cast_fp16)[name = tensor<string, []>("model_2_1_conv_dw_9_bn_1_batchnorm_add_1_cast_fp16")];
            tensor<fp16, [1, 512, 14, 14]> model_2_1_conv_dw_9_relu_1_Relu6_cast_fp16 = relu6(x = model_2_1_conv_dw_9_bn_1_batchnorm_add_1_cast_fp16)[name = tensor<string, []>("model_2_1_conv_dw_9_relu_1_Relu6_cast_fp16")];
            tensor<string, []> model_2_1_conv_pw_9_bn_1_batchnorm_mul_1x_pad_type_0 = const()[name = tensor<string, []>("model_2_1_conv_pw_9_bn_1_batchnorm_mul_1x_pad_type_0"), val = tensor<string, []>("same")];
            tensor<int32, [2]> model_2_1_conv_pw_9_bn_1_batchnorm_mul_1x_strides_0 = const()[name = tensor<string, []>("model_2_1_conv_pw_9_bn_1_batchnorm_mul_1x_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> model_2_1_conv_pw_9_bn_1_batchnorm_mul_1x_dilations_0 = const()[name = tensor<string, []>("model_2_1_conv_pw_9_bn_1_batchnorm_mul_1x_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> model_2_1_conv_pw_9_bn_1_batchnorm_mul_1x_groups_0 = const()[name = tensor<string, []>("model_2_1_conv_pw_9_bn_1_batchnorm_mul_1x_groups_0"), val = tensor<int32, []>(1)];
            tensor<int32, [4]> model_2_1_conv_pw_9_bn_1_batchnorm_mul_1x_pad_0 = const()[name = tensor<string, []>("model_2_1_conv_pw_9_bn_1_batchnorm_mul_1x_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [512, 512, 1, 1]> transpose_36_to_fp16 = const()[name = tensor<string, []>("transpose_36_to_fp16"), val = tensor<fp16, [512, 512, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1617472)))];
            tensor<fp16, [512]> const_62_to_fp16 = const()[name = tensor<string, []>("const_62_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2141824)))];
            tensor<fp16, [1, 512, 14, 14]> model_2_1_conv_pw_9_bn_1_batchnorm_add_1_cast_fp16 = conv(bias = const_62_to_fp16, dilations = model_2_1_conv_pw_9_bn_1_batchnorm_mul_1x_dilations_0, groups = model_2_1_conv_pw_9_bn_1_batchnorm_mul_1x_groups_0, pad = model_2_1_conv_pw_9_bn_1_batchnorm_mul_1x_pad_0, pad_type = model_2_1_conv_pw_9_bn_1_batchnorm_mul_1x_pad_type_0, strides = model_2_1_conv_pw_9_bn_1_batchnorm_mul_1x_strides_0, weight = transpose_36_to_fp16, x = model_2_1_conv_dw_9_relu_1_Relu6_cast_fp16)[name = tensor<string, []>("model_2_1_conv_pw_9_bn_1_batchnorm_add_1_cast_fp16")];
            tensor<fp16, [1, 512, 14, 14]> model_2_1_conv_pw_9_relu_1_Relu6_cast_fp16 = relu6(x = model_2_1_conv_pw_9_bn_1_batchnorm_add_1_cast_fp16)[name = tensor<string, []>("model_2_1_conv_pw_9_relu_1_Relu6_cast_fp16")];
            tensor<string, []> model_2_1_conv_dw_10_1_depthwisex_pad_type_0 = const()[name = tensor<string, []>("model_2_1_conv_dw_10_1_depthwisex_pad_type_0"), val = tensor<string, []>("same")];
            tensor<int32, [2]> model_2_1_conv_dw_10_1_depthwisex_strides_0 = const()[name = tensor<string, []>("model_2_1_conv_dw_10_1_depthwisex_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> model_2_1_conv_dw_10_1_depthwisex_dilations_0 = const()[name = tensor<string, []>("model_2_1_conv_dw_10_1_depthwisex_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> model_2_1_conv_dw_10_1_depthwisex_groups_0 = const()[name = tensor<string, []>("model_2_1_conv_dw_10_1_depthwisex_groups_0"), val = tensor<int32, []>(512)];
            tensor<int32, [4]> model_2_1_conv_dw_10_1_depthwisex_pad_0 = const()[name = tensor<string, []>("model_2_1_conv_dw_10_1_depthwisex_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [512, 1, 3, 3]> model_2_1_conv_dw_10_bn_1_batchnorm_mul_1_weight_0_to_fp16 = const()[name = tensor<string, []>("model_2_1_conv_dw_10_bn_1_batchnorm_mul_1_weight_0_to_fp16"), val = tensor<fp16, [512, 1, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2142912)))];
            tensor<fp16, [512]> const_63_to_fp16 = const()[name = tensor<string, []>("const_63_to_fp16"), val = tensor<fp16, [512]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2152192)))];
